{"title":"Is self improvement good","content":{"type":"doc","content":[{"type":"heading","attrs":{"level":1},"content":[{"type":"text","text":"Is self improvement good"}]},{"type":"paragraph","content":[{"type":"text","text":"It's a loaded question, because obviously it is good to improve. The good writer is better than the bad writer because the good writer improved more than the bad. The good person improves more than the bad. These kinds of things are trivially true by the definition of greater than signs."}]},{"type":"paragraph","content":[{"type":"text","text":"Moving past the positive associations of a positively associated word is more interesting: is "},{"type":"text","marks":[{"type":"bold"}],"text":"doing"},{"type":"text","text":" self-improvement good? This is a similar-but-not-identical question that is much less obvious than the first one. We can assume that there are many many axes where \"good\" is on the right and \"bad\" is on the left. These can be anything from guitar to writing to speaking to niceness. How valuable is it to abstract \"improvement\" away from any one of those axes?"}]},{"type":"paragraph","content":[{"type":"text","text":"There is an industry of these routines. Habits of effective people, making friends, influencing people, being a prince, statistically optimized decision theory, cognitive biases-- there are many approaches to take. Some might read Aurelius and decide to maintain levity under pressure, while others read a bright orange cover that teaches them how to say Fuck without looking over your shoulder."}]},{"type":"paragraph","content":[{"type":"text","text":"But what's the point of any of it? Are there really habits and routines that touch \"improvement\" directly, independent of any particular creative axis? No. Optimizing improvement has no greater impact on the mind's ability to optimize than than optimizing playing guitar. "}]}]},"excerpt":" It's a loaded question, because obviously it is good to improve. The good writer is better than the ","date":"Tue Dec 13 2022 00:22:39 GMT+0000 (Coordinated Universal Time)"}