{"title":"Why Not Limit City Citizenship?","content":{"type":"doc","content":[{"type":"heading","attrs":{"level":1},"content":[{"type":"text","text":"Why Not Limit City Citizenship?"}]},{"type":"paragraph","content":[{"type":"hardBreak"}]},{"type":"paragraph","content":[{"type":"text","text":"The most common argument I hear offered against allowing more immigration is that immigrants will compete with natives in local markets, including labor, mating, and housing markets. But economists understand that in competitive markets any benefits that natives gain from restricting such trade come from larger costs imposed on others. The world, and even most locals, would then be better off without immigration restrictions. So the world would be trying to coordinate to prevent such restrictions."}]},{"type":"paragraph","content":[{"type":"text","text":"To economists, a better argument talks about quality control. Roommates, housing complexes, professions, workgroups, franchise groups, clubs, and many other units of social organization often control who is allowed to join them, in order to select for high quality members, and to give members incentives to behave well. The argument says: why can’t it make sense for nations to do similarly?"}]},{"type":"paragraph","content":[{"type":"text","text":"The main problem I have with this argument is that we usually only allow membership vetos when a group shares a brand, as in professions or franchise groups. Or when associates have pretty close interactions with the member in question. For example, we don’t usually let distant family members veto who individuals marry, distant parts of a firm veto who is hired in any one workgroup, or distant neighbors veto to whom people may sell their houses."}]},{"type":"paragraph","content":[{"type":"text","text":"Furthermore, the same argument that says nations could benefit from quality control of members seems to also apply to smaller units of spatial organization, such as regions, states, counties, cities, and neighborhoods. Yet not only are such limits rare, nations often "},{"type":"text","marks":[{"type":"italic"}],"text":"prohibit"},{"type":"text","text":" such limitations by law; cities may not legally limit who lives there. (Beyond of course requiring one to pay the local prices to live there.) Our laws often even restrict the abilities of individual businesses and clubs to limit their employees and customers. Why require quality control at the national level, and yet prevent it at other large scales?"}]},{"type":"paragraph","content":[{"type":"text","text":"I’m really asking these questions; I don’t have good answers yet. This feels to me less like quality control, and more like nations wanting to fill a particular slot in citizen lives. Like how your romantic partner might object to your having other romantic partners, nations seem jealous of allowing other comparable social units to also limit membership. As if by allowing regions, states, counties, cities, or neighborhoods to limit membership, the nation would be letting a “romantic” rival vie for your allegiance. Only the nation is allowed to sit in that emotional slot?"}]},{"type":"paragraph","content":[{"type":"text","text":"Or maybe not; what other explanations can you offer here?"}]}]},"excerpt":"  The most common argument I hear offered against allowing more immigration is that immigrants will co","date":"Thu Jan 26 2023 02:12:17 GMT+0000 (Coordinated Universal Time)"}